n0_list = {1: 'один', 2: 'два', 3: 'три', 4: 'четыре', 5: 'пять',
           6: 'шесть', 7: 'семь', 8: 'восемь', 9: 'девять'}
n1_list = {11: 'одиннадцать', 12: 'двенадцать', 13: 'тринадцать',
           14: 'четырнадцать', 15: 'пятнадцать', 16: 'шестнадцать',
           17: 'семнадцать', 18: 'восемнадцать', 19: 'девятнадцать'}
n2_list = {10: 'десять', 20: 'двадцать', 30: 'тридцать', 40: 'сорок', 50: 'пятьдесят',
           60: 'шестьдесят', 70: 'семьдесят', 80: 'восемьдесят', 90: 'девяносто'}
n3_list = {100: 'сто', 200: 'двести', 300: 'триста', 400: 'четыресто', 500: 'пятьсот',
           600: 'шестьсот', 700: 'семьсот', 800: 'восемьсот', 900: 'девятьсот'}
lst = []

while True:
    n_str = input("Введите целое число от 1 до 999: ")
    if n_str.isdigit():
        if 1 <= int(n_str) <= 999:
            break
n = int(n_str)

n_100 = n - n % 100
n_10 = n - n//100 * 100
n_10_out = n_10//10 * 10
n_1 = n_10 - n_10_out

if n_100 in n3_list:
    lst.append(n3_list[n_100])
if n_10 in n1_list:
    lst.append(n1_list[n_10])
else:
    if n_10_out in n2_list:
        lst.append(n2_list[n_10_out])
    if n_1 in n0_list:
        lst.append(n0_list[n_1])

print(" ".join(lst))
